---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry
source: html/fa14442f-3d47-2c21-467c-6d19e4cc0d9e.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry

This class gives access to external services.
 Use it to register external services with Revit and execute them.
 Only the application that registers a service is allowed to execute it.

## Syntax (C#)
```csharp
public static class ExternalServiceRegistry
```